#include "lotus/charset.hpp"

namespace lotus {

const std::unordered_map<std::u16string, CharsetDefinition> CHARSET_DEFINITIONS = {
    { u"Unicode", {
        {U'đ', U"đ"}, {U'â', U"â"}, {U'ă', U"ă"}, {U'ê', U"ê"}, {U'ô', U"ô"}, {U'ơ', U"ơ"}, {U'ư', U"ư"},
        {U'á', U"á"}, {U'à', U"à"}, {U'ả', U"ả"}, {U'ã', U"ã"}, {U'ạ', U"ạ"},
        {U'ấ', U"ấ"}, {U'ầ', U"ầ"}, {U'ẩ', U"ẩ"}, {U'ẫ', U"ẫ"}, {U'ậ', U"ậ"},
        {U'ắ', U"ắ"}, {U'ằ', U"ằ"}, {U'ẳ', U"ẳ"}, {U'ẵ', U"ẵ"}, {U'ặ', U"ặ"},
        {U'é', U"é"}, {U'è', U"è"}, {U'ẻ', U"ẻ"}, {U'ẽ', U"ẽ"}, {U'ẹ', U"ẹ"},
        {U'ế', U"ế"}, {U'ề', U"ề"}, {U'ể', U"ể"}, {U'ễ', U"ễ"}, {U'ệ', U"ệ"},
        {U'í', U"í"}, {U'ì', U"ì"}, {U'ỉ', U"ỉ"}, {U'ĩ', U"ĩ"}, {U'ị', U"ị"},
        {U'ó', U"ó"}, {U'ò', U"ò"}, {U'ỏ', U"ỏ"}, {U'õ', U"õ"}, {U'ọ', U"ọ"},
        {U'ố', U"ố"}, {U'ồ', U"ồ"}, {U'ổ', U"ổ"}, {U'ỗ', U"ỗ"}, {U'ộ', U"ộ"},
        {U'ớ', U"ớ"}, {U'ờ', U"ờ"}, {U'ở', U"ở"}, {U'ỡ', U"ỡ"}, {U'ợ', U"ợ"},
        {U'ú', U"ú"}, {U'ù', U"ù"}, {U'ủ', U"ủ"}, {U'ũ', U"ũ"}, {U'ụ', U"ụ"},
        {U'ứ', U"ứ"}, {U'ừ', U"ừ"}, {U'ử', U"ử"}, {U'ữ', U"ữ"}, {U'ự', U"ự"},
        {U'ý', U"ý"}, {U'ỳ', U"ỳ"}, {U'ỷ', U"ỷ"}, {U'ỹ', U"ỹ"}, {U'ỵ', U"ỵ"},
        {U'Đ', U"Đ"}, {U'Â', U"Â"}, {U'Ă', U"Ă"}, {U'Ê', U"Ê"}, {U'Ô', U"Ô"}, {U'Ơ', U"Ơ"}, {U'Ư', U"Ư"},
        {U'Á', U"Á"}, {U'À', U"À"}, {U'Ả', U"Ả"}, {U'Ã', U"Ã"}, {U'Ạ', U"Ạ"},
        {U'Ấ', U"Ấ"}, {U'Ầ', U"Ầ"}, {U'Ẩ', U"Ẩ"}, {U'Ẫ', U"Ẫ"}, {U'Ậ', U"Ậ"},
        {U'Ắ', U"Ắ"}, {U'Ằ', U"Ằ"}, {U'Ẳ', U"Ẳ"}, {U'Ẵ', U"Ẵ"}, {U'Ặ', U"Ặ"},
        {U'É', U"É"}, {U'È', U"È"}, {U'Ẻ', U"Ẻ"}, {U'Ẽ', U"Ẽ"}, {U'Ẹ', U"Ẹ"},
        {U'Ế', U"Ế"}, {U'Ề', U"Ề"}, {U'Ể', U"Ể"}, {U'Ễ', U"Ễ"}, {U'Ệ', U"Ệ"},
        {U'Í', U"Í"}, {U'Ì', U"Ì"}, {U'Ỉ', U"Ỉ"}, {U'Ĩ', U"Ĩ"}, {U'Ị', U"Ị"},
        {U'Ó', U"Ó"}, {U'Ò', U"Ò"}, {U'Ỏ', U"Ỏ"}, {U'Õ', U"Õ"}, {U'Ọ', U"Ọ"},
        {U'Ố', U"Ố"}, {U'Ồ', U"Ồ"}, {U'Ổ', U"Ổ"}, {U'Ỗ', U"Ỗ"}, {U'Ộ', U"Ộ"},
        {U'Ớ', U"Ớ"}, {U'Ờ', U"Ờ"}, {U'Ở', U"Ở"}, {U'Ỡ', U"Ỡ"}, {U'Ợ', U"Ợ"},
        {U'Ú', U"Ú"}, {U'Ù', U"Ù"}, {U'Ủ', U"Ủ"}, {U'Ũ', U"Ũ"}, {U'Ụ', U"Ụ"},
        {U'Ứ', U"Ứ"}, {U'Ừ', U"Ừ"}, {U'Ử', U"Ử"}, {U'Ữ', U"Ữ"}, {U'Ự', U"Ự"},
        {U'Ý', U"Ý"}, {U'Ỳ', U"Ỳ"}, {U'Ỷ', U"Ỷ"}, {U'Ỹ', U"Ỹ"}, {U'Ỵ', U"Ỵ"}
    }}
};

} // namespace lotus
